Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI
Contains all imported functions from native side

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.EngineConnectionChanged
Get or set the Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.ConnectionChangedDelegate to be called on connection changes

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GraphComputed
Gets or sets the Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GraphComputedDelegate to be called on graph compute end event

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GraphComputeStarted
Gets or sets the Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GraphComputeStartDelegate to be called on graph compute start event

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.RegisterCallbacks
Registers the callbacks.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.UnregisterCallbacks
Unregisters the callbacks.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.Connect(System.String,System.String)
Imported native method used to connect to the Materia server.
TIDToken: The Trimble ID token
TAccessToken: The Trimble access token
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.IsConnected
Imported native method used to check if the connection to the Materia server is active.
Returns: true if the connection is active, false otherwise

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.Disconnect
Imported native method used to disconnect from Materia server.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.LoadGraph(System.String)
Imported native method used to load the Materia graph.
Uri: The Materia graph Uri
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.LoadGraphWithParameters(System.String,Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphParameter[],System.Int32)
Imported native method used to load the Materia graph using the specified parameters.
Uri: The Materia graph Uri
Parameters: The graph parameters
Size: The size of the container containing the parameters
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GetParameters(System.String,System.Int32@,System.IntPtr@)
Imported native method used to get the Materia graph parameters.
GraphGuid: The Materia graph GUID
Size: The size of the container containing the parameters
Parameters: The graph parameters

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.SetParameter(System.String,System.String,System.String)
Imported native method used to set a Materia graph parameter.
GraphGuid: The Materia graph GUID
ParameterName: The parameter name
ParameterValue: The parameter value

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GetAssetList(System.String,System.Int32@,System.IntPtr@)
Imported native method used to search for an asset using the string provided as parameter
StringSearch: The string used to search
Size: The size of the retrieved results array
Assets: The array containing the search result

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.GetTrimBimGeometry(System.String)
Gets the geometry as TrimBIM string
graphGUID: The graph GUID
Returns: The TrimBIM geometry as a string

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.MarshalUnmanagedArrayOfStructs``1(System.IntPtr,System.Int32)
Translates a native array of structs to a list of structs
The struct type
unmanagedArray: The native array
length: The array size
Returns:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.NativeAPI.ConvertCoMemString(System.IntPtr)
Converts a native string(char pointer) to managed string without memory leaks.
CharPointer: The native chair pointer
Returns: